# Загрузка данных

Подключение библиотек

In [1]:
import pandas as pd

Загрузка данных

In [4]:
try:
    data_arc_new=pd.read_csv('datasets/data_arc_new.csv')
    data_bulk_new=pd.read_csv('datasets/data_bulk_new.csv')
    data_bulk_time_new=pd.read_csv('datasets/data_bulk_time_new.csv')
    data_gas_new=pd.read_csv('datasets/data_gas_new.csv')
    data_temp_new=pd.read_csv('datasets/data_temp_new.csv')
    data_wire_new=pd.read_csv('datasets/data_wire_new.csv')
    data_wire_time_new=pd.read_csv('datasets/data_wire_time_new.csv')
except FileNotFoundError:
    data_arc_new=pd.read_csv('data_arc_new.csv')
    data_bulk_new=pd.read_csv('data_bulk_new.csv')
    data_bulk_time_new=pd.read_csv('data_bulk_time_new.csv')
    data_gas_new=pd.read_csv('data_gas_new.csv')
    data_temp_new=pd.read_csv('data_temp_new.csv')
    data_wire_new=pd.read_csv('data_wire_new.csv')
    data_wire_time_new=pd.read_csv('data_wire_time_new.csv')

### data_arc_new

Вывод информации о данных

In [5]:
data_arc_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14876 entries, 0 to 14875
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   key                   14876 non-null  int64
 1   Начало нагрева дугой  14876 non-null  object
 2   Конец нагрева дугой   14876 non-null  object
 3   Активная мощность     14876 non-null  float64
 4   Реактивная мощность   14876 non-null  float64
dtypes: float64(2), int64(1), object(2)
memory usage: 581.2+ KB

Вывод первых пяти строк

In [6]:
data_arc_new.head()

,key,Начало нагрева дугой,Конец нагрева дугой,Активная мощность,Реактивная мощность
0,1,2019-05-03 11:02:14,2019-05-03 11:06:02,0.305130,0.211253
1,1,2019-05-03 11:07:28,2019-05-03 11:10:33,0.765658,0.477438
2,1,2019-05-03 11:11:44,2019-05-03 11:14:36,0.580313,0.430460
3,1,2019-05-03 11:18:14,2019-05-03 11:24:19,0.518496,0.379979
4,1,2019-05-03 11:26:09,2019-05-03 11:28:37,0.867133,0.643691

Обнаружение пропусков в данных

In [9]:
data_arc_new.isna().sum()

key                     0
Начало нагрева дугой    0
Конец нагрева дугой     0
Активная мощность       0
Реактивная мощность     0
dtype: int64

Так как пропусков не обнаружено посмотрим на количество дубликатов

In [7]:
data_arc_new.duplicated().sum()

0

Сменим тип данных в столбцах на подходящий

In [10]:
data_arc_new['Начало нагрева дугой'] = pd.to_datetime(data_arc_new['Начало нагрева дугой'])
data_arc_new['Конец нагрева дугой'] = pd.to_datetime(data_arc_new['Конец нагрева дугой'])

После смены типов данных посмотрим на информацию о данных

In [12]:
data_arc_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14876 entries, 0 to 14875
Data columns (total 5 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   key                   14876 non-null  int64
 1   Начало нагрева дугой  14876 non-null  datetime64[ns]
 2   Конец нагрева дугой   14876 non-null  datetime64[ns]
 3   Активная мощность     14876 non-null  float64
 4   Реактивная мощность   14876 non-null  float64
dtypes: datetime64[ns](2), float64(2), int64(1)
memory usage: 581.2 KB

Вывод описательной статистики

In [13]:
data_arc_new.describe()

,key,Начало нагрева дугой,Конец нагрева дугой,Активная мощность,Реактивная мощность
count,14876.000000,14876,14876,14876.000000,14876.000000
mean,1615.220422,2019-07-05 12:25:51.921081088,2019-07-05 12:28:43.592027392,0.662752,0.438986
min,1.000000,2019-05-03 11:02:14,2019-05-03 11:06:02,0.223120,-715.479924
25%,806.000000,2019-06-03 23:18:23.249999872,2019-06-03 23:21:35,0.467115,0.337175
50%,1617.000000,2019-07-03 01:31:26.500000,2019-07-03 01:35:13,0.599587,0.441639
75%,2429.000000,2019-08-07 22:52:20.750000128,2019-08-07 22:56:47,0.830070,0.608201
max,3241.000000,2019-09-06 17:24:54,2019-09-06 17:26:15,1.463773,1.270284
std,934.571502,NaN,NaN,0.258885,5.873485

### data_bulk_new

Вывод информации о данных

In [14]:
data_bulk_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3129 entries, 0 to 3128
Data columns (total 16 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   key      3129 non-null   int64
 1   Bulk 1   252 non-null    float64
 2   Bulk 2   22 non-null     float64
 3   Bulk 3   1298 non-null   float64
 4   Bulk 4   1014 non-null   float64
 5   Bulk 5   77 non-null     float64
 6   Bulk 6   576 non-null    float64
 7   Bulk 7   25 non-null     float64
 8   Bulk 8   1 non-null      float64
 9   Bulk 9   19 non-null     float64
 10  Bulk 10  176 non-null    float64
 11  Bulk 11  177 non-null    float64
 12  Bulk 12  2450 non-null   float64
 13  Bulk 13  18 non-null     float64
 14  Bulk 14  2806 non-null   float64
 15  Bulk 15  2248 non-null   float64
dtypes: float64(15), int64(1)
memory usage: 391.3 KB

Вывод первых пяти строк данных

In [15]:
data_bulk_new.head()

,key,Bulk 1,Bulk 2,Bulk 3,Bulk 4,Bulk 5,Bulk 6,Bulk 7,Bulk 8,Bulk 9,Bulk 10,Bulk 11,Bulk 12,Bulk 13,Bulk 14,Bulk 15
0,1,NaN,NaN,NaN,43.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,206.0,NaN,150.0,154.0
1,2,NaN,NaN,NaN,73.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,206.0,NaN,149.0,154.0
2,3,NaN,NaN,NaN,34.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,205.0,NaN,152.0,153.0
3,4,NaN,NaN,NaN,81.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,207.0,NaN,153.0,154.0
4,5,NaN,NaN,NaN,78.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,203.0,NaN,151.0,152.0

Просмотр уникальных значений в столбиках

In [24]:
data_bulk_new['Bulk 4'].unique()
data_bulk_new['Bulk 12'].unique()
data_bulk_new['Bulk 14'].unique()
data_bulk_new['Bulk 15'].unique()

array([154., 153., 152., 203., 204., 202.,  nan, 101., 104., 156., 155.,
       205., 159., 124., 134., 105., 206., 201., 151., 103., 158., 102.,
       111., 114., 157.,  64., 125., 218., 223., 187., 175., 222., 224.,
       106., 188., 200., 225., 183., 178., 210., 149.,   1., 221., 405.,
       186., 196., 185., 150.,  44., 189., 167.,  55., 166., 211., 110.,
       209., 113., 190., 176., 112., 177., 164.,  99., 100.,  52.,  53.,
        85., 207., 197., 193., 208.,  51., 163., 148., 212., 216., 213.,
       258., 217., 220., 214., 215., 227.,  86.,  63., 219., 198., 145.,
       251., 199., 126., 123.,  54.,  73., 117., 127., 181., 191., 118.,
       228., 116., 160., 179., 192.,  56., 169., 260., 107., 168., 261.,
        10.,  59., 194.,  75.,  87., 290., 147., 295., 226., 232.,  69.,
       235., 128., 108., 137.,  65., 170., 337., 161., 231., 109., 174.,
       172., 171., 236., 115., 239., 233., 240., 230., 237., 246., 229.,
       238., 234., 136.,  74.,  58.,  72., 320.,  50., 322.,  70., 262.,
       264., 266.,  88.])

### data_bulk_time_new

Вывод информации о данных

In [16]:
data_bulk_time_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3129 entries, 0 to 3128
Data columns (total 16 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   key      3129 non-null   int64
 1   Bulk 1   252 non-null    object
 2   Bulk 2   22 non-null     object
 3   Bulk 3   1298 non-null   object
 4   Bulk 4   1014 non-null   object
 5   Bulk 5   77 non-null     object
 6   Bulk 6   576 non-null    object
 7   Bulk 7   25 non-null     object
 8   Bulk 8   1 non-null      object
 9   Bulk 9   19 non-null     object
 10  Bulk 10  176 non-null    object
 11  Bulk 11  177 non-null    object
 12  Bulk 12  2450 non-null   object
 13  Bulk 13  18 non-null     object
 14  Bulk 14  2806 non-null   object
 15  Bulk 15  2248 non-null   object
dtypes: int64(1), object(15)
memory usage: 391.3+ KB

Вывод первых пяти строк данных

In [17]:
data_bulk_time_new.head()

,key,Bulk 1,Bulk 2,Bulk 3,Bulk 4,Bulk 5,Bulk 6,Bulk 7,Bulk 8,Bulk 9,Bulk 10,Bulk 11,Bulk 12,Bulk 13,Bulk 14,Bulk 15
0,1,NaN,NaN,NaN,2019-05-03 11:28:48,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2019-05-03 11:24:31,NaN,2019-05-03 11:14:50,2019-05-03 11:10:43
1,2,NaN,NaN,NaN,2019-05-03 11:36:50,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2019-05-03 11:53:30,NaN,2019-05-03 11:48:37,2019-05-03 11:44:39
2,3,NaN,NaN,NaN,2019-05-03 12:32:39,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2019-05-03 12:27:13,NaN,2019-05-03 12:21:01,2019-05-03 12:16:16
3,4,NaN,NaN,NaN,2019-05-03 12:43:22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2019-05-03 12:58:00,NaN,2019-05-03 12:51:11,2019-05-03 12:46:36
4,5,NaN,NaN,NaN,2019-05-03 13:30:47,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2019-05-03 13:30:47,NaN,2019-05-03 13:34:12,2019-05-03 13:30:47

Обнаружение пропусков в столбцах

In [28]:
data_bulk_time_new['Bulk 4'].isna().sum()

2115

In [29]:
data_bulk_time_new['Bulk 12'].isna().sum()

679

In [30]:
data_bulk_time_new['Bulk 14'].isna().sum()

323

In [31]:
data_bulk_time_new['Bulk 15'].isna().sum()

881

### data_gas_new

Вывод информации о данных

In [32]:
data_gas_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3239 entries, 0 to 3238
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   key     3239 non-null   int64
 1   Газ 1   3239 non-null   float64
dtypes: float64(1), int64(1)
memory usage: 50.7 KB

Вывод первых пяти строк в данных

In [33]:
data_gas_new.head()

   key      Газ 1
0    1  29.749986
1    2  12.555561
2    3  28.554793
3    4  18.841219
4    5   5.413692

Поиск пропусков

In [52]:
data_gas_new.isna().sum()

key      0
Газ 1    0
dtype: int64

Поиск дубликатов

In [53]:
data_gas_new.duplicated().sum()

0

Вывод описательной статистики

In [34]:
data_gas_new.describe()

               key        Газ 1
count  3239.000000  3239.000000
mean   1621.861377    11.002062
std     935.386334     6.220327
min       1.000000     0.008399
25%     812.500000     7.043089
50%    1622.000000     9.836267
75%    2431.500000    13.769915
max    3241.000000    77.995040

### data_temp_new

Вывод информации о данных

In [35]:
data_temp_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18092 entries, 0 to 18091
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   key           18092 non-null  int64
 1   Время замера  18092 non-null  object
 2   Температура   14665 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 424.2+ KB

Вывод первых пяти строк в данных

In [36]:
data_temp_new.head()

   key         Время замера  Температура
0    1  2019-05-03 11:02:04       1571.0
1    1  2019-05-03 11:07:18       1604.0
2    1  2019-05-03 11:11:34       1618.0
3    1  2019-05-03 11:18:04       1601.0
4    1  2019-05-03 11:25:59       1606.0

Поиск пропусков в данных

In [39]:
data_temp_new['Температура'].isna().sum()

3427

Вывод уникальных значений

In [40]:
data_temp_new['Температура'].unique()

array([1571., 1604., 1618., 1601., 1606., 1613., 1581., 1577., 1589.,
       1602., 1596., 1597., 1598., 1599., 1600., 1623., 1617., 1625.,
       1576., 1592., 1586., 1543., 1582., 1595., 1587., 1574., 1580.,
       1585., 1593., 1616., 1608., 1583., 1588., 1591., 1610., 1621.,
       1615., 1619., 1605., 1607., 1611., 1590., 1609., 1584., 1603.,
       1579., 1626., 1560., 1563., 1594., 1612., 1578., 1566., 1572.,
       1575., 1567., 1562., 1564., 1614., 1573., 1570., 1538., 1556.,
       1542., 1565., 1660., 1659., 1654., 1690., 1652., 1666., 1667.,
       1669., 1668., 1642., 1658., 1671., 1630., 1655., 1663., 1635.,
       1656., 1641., 1631., 1653., 1648., 1569., 1559., 1558., 1548.,
       1541., 1553., 1662., 1679., 1637., 1644., 1622., 1624., 1649.,
       1629., 1643., 1526., 1550., 1561., 1557., 1544., 1568., 1620.,
       1645., 1647., 1638., 1547., 1627., 1628., 1551., 1549., 1650.,
       1684., 1634., 1651., 1633., 1640., 1554., 1532., 1632., 1704.,
       1705., 1700., 1665., 1673., 1661., 1672., 1657., 1675., 1646.,
       1552., 1520., 1555., 1529., 1636., 1545., 1530., 1539., 1540.,
       1546., 1531., 1639., 1670., 1678., 1191., 1522., 1521., 1537.,
       1676., 1533., 1208., 1674., 1527., 1525., 1535., 1681., 1536.,
       1218., 1519., 1534., 1691., 1696., 1227., 1515., 1528., 1680.,
         nan, 1204.])

Смена типа данных в столбце

In [41]:
data_temp_new['Время замера'] = pd.to_datetime(data_temp_new['Время замера'])

Вывод информации о данных после смены типа

In [42]:
data_temp_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18092 entries, 0 to 18091
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   key           18092 non-null  int64
 1   Время замера  18092 non-null  datetime64[ns]
 2   Температура   14665 non-null  float64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 424.2 KB

Вывод описательной статистики

In [43]:
data_temp_new.describe()

                key                   Время замера   Температура
count  18092.000000                          18092  14665.000000
mean    1616.460977  2019-07-05 13:36:58.791620608   1590.722741
min        1.000000            2019-05-03 11:02:04   1191.000000
25%      807.750000  2019-06-04 00:35:01.249999872   1580.000000
50%     1618.000000            2019-07-03 02:11:48   1590.000000
75%     2429.000000  2019-08-07 23:10:05.249999872   1599.000000
max     3241.000000            2019-09-06 17:30:05   1705.000000
std      934.641385                            NaN     20.394381

### data_wire_new

Вывод информации о данных

In [44]:
data_wire_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3081 entries, 0 to 3080
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   key     3081 non-null   int64
 1   Wire 1  3055 non-null   float64
 2   Wire 2  1079 non-null   float64
 3   Wire 3  63 non-null     float64
 4   Wire 4  14 non-null     float64
 5   Wire 5  1 non-null      float64
 6   Wire 6  73 non-null     float64
 7   Wire 7  11 non-null     float64
 8   Wire 8  19 non-null     float64
 9   Wire 9  29 non-null     float64
dtypes: float64(9), int64(1)
memory usage: 240.8 KB

Вывод первых пяти строчек в данных

In [45]:
data_wire_new.head()

,key,Wire 1,Wire 2,Wire 3,Wire 4,Wire 5,Wire 6,Wire 7,Wire 8,Wire 9
0,1,60.059998,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,96.052315,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,91.160157,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,89.063515,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,89.238236,9.11456,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Поиск пропусков

In [46]:
data_wire_new['Wire 1'].isna().sum()

26

### data_wire_time_new

Вывод ифнормации о данных

In [48]:
data_wire_time_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3081 entries, 0 to 3080
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   key     3081 non-null   int64
 1   Wire 1  3055 non-null   object
 2   Wire 2  1079 non-null   object
 3   Wire 3  63 non-null     object
 4   Wire 4  14 non-null     object
 5   Wire 5  1 non-null      object
 6   Wire 6  73 non-null     object
 7   Wire 7  11 non-null     object
 8   Wire 8  19 non-null     object
 9   Wire 9  29 non-null     object
dtypes: int64(1), object(9)
memory usage: 240.8+ KB

Вывод первых пяти строчек данных

In [49]:
data_wire_time_new.head()

,key,Wire 1,Wire 2,Wire 3,Wire 4,Wire 5,Wire 6,Wire 7,Wire 8,Wire 9
0,1,2019-05-03 11:06:19,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,2019-05-03 11:36:50,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,2019-05-03 12:11:46,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,2019-05-03 12:43:22,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,2019-05-03 13:20:44,2019-05-03 13:15:34,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Поиск пропусков в столбике

In [50]:
data_wire_time_new['Wire 1'].isna().sum()

26

# Анализ и предобработка данных